#                           Сумма трёх чисел
# Напишите программу, которая считывает три целых числа и выводит на экран их сумму. 
# Каждое число записано в отдельной строке.

# Формат входных данных
# На вход программе подаются три целых числа, каждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести сумму введённых чисел.

num1, num2, num3 = int(input()), int(input()), int(input())
print(num1 + num2 + num3)