# Напишите программу, которая принимает на вход два числа a и b,
# вычисляет сумму, разность и произведение для этих чисел.

a = int(input())
b = int(input())

print(a, '+', b, '=', a + b)
print(a, '-', b, '=', a - b)
print(a, '*', b, '=', a * b)