#                                      Площадь треугольника 📐.
# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

a,b = float(input()),float(input())
s = (a * b) / 2
print(s)