# 51 градус по Фаренгейту 🌡️
# У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту».
# Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует
# указанное значение по шкале Фаренгейта.

fahr = float(input())
cel = 5 / 9 * (fahr - 32)
print(cel)
