#                   Последовательность символов.
# Напишите программу, которая используется ровно три цикла for для печати
# последовательности символов.

for i in range(6):
    print('A' * 3)
for i in range(5):
    print('B' * 4)
print('E')
for i in range(9):
    print('T' * 5)
print('G')