#                           Факториал ❗
# На вход программе подаётся натуральное число n.
# Напишите программу, которая вычисляет n!.

from math import factorial
print(factorial(int(input())))
