#                       Футбольная команда ⚽.
# Напишите программу, которая считывает с клавиатуры название футбольной команды и
# выводит информацию о ней в следующем формате:
# Футбольная команда <название футбольной команды> имеет длину <длина названия футбольной команды> символов

team = input()
print("Футбольная команда", team, "имеет длину", len(team), "символов")
