#                                       Здравствуй, мир! 🌏
# Напишите программу, которая выводит на экран следующий текст:
# --> Здравствуй, мир!
           
# Формат входных данных
# На вход программе ничего не подаётся.
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

print("Здравствуй, мир!")