#               Счастливая последовательность 2 🍀
# Измените предыдущую программу так, 
# чтобы каждое число последовательности «4 8 15 16 23 42» печаталось на отдельной строке.

# Формат входных данных
# На вход программе ничего не подаётся.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

# Примечание. 
# Каждая последующая команда print() выводит указанный текст, начиная с новой строки.

print('4')
print('8')
print('15')
print('16')
print('23')
print('42')