#                               Приветствие 👋
# На вход программе подаётся строка текста – имя человека. 
# Напишите программу, которая принимает эту строку текста через стандартный поток ввода (команда input()). 
# Далее программа должна выводить на экран приветствие в следующем формате:
#
# --> Привет, <имя человека>
#           
# где <имя человека> – строка текста, которую ваша программа приняла на вход.
#
# Формат входных данных
# На вход программе подаётся одна строка – имя человека.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

name = input()
print("Привет,", name)