#                           Любимая команда ⚽
# На вход программе подаётся строка текста – название футбольной команды. 
# Напишите программу, которая принимает через стандартный поток ввода (команда input()) 
# эту строку и печатает предложение в следующем формате:
#
# <название футбольной команды> - чемпион!
#                 
# где <название футбольной команды> – строка текста, которую ваша программа приняла на вход.

#Формат входных данных
#На вход программе подаётся название футбольной команды.

#Формат выходных данных
#Программа должна вывести текст в соответствии с условием задачи.

print(input(), '- чемпион!')