#                                   Повторяй за мной 2 🔁
# Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, 
# а затем выводит их в обратной последовательности, каждую на отдельной строке.

# Формат входных данных
# На вход программе подаются три строки, каждая на отдельной строке.

# Формат выходных данных
# Программа должна вывести введённые строки в обратной последовательности, каждую на отдельной строке.

text_1 = input()
text_2 = input()
text_3 = input()
print(text_3)
print(text_2)
print(text_1)